Revit 2027 API
FabricationConfiguration.GetMaterialName Method
 Gets material name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetMaterialName(
	int materialId
)
Public Function GetMaterialName (
	materialId As Integer
) As String
public:
String^ GetMaterialName(
	int materialId
)
member GetMaterialName :
        materialId : int -> string
Parameters
materialId Int32
 The material identifier.
Return Value
String
 The material name without the group.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace